Revit 2027 API
StructuralSectionHotRolled.FlangeThicknessLocation Property
 Flange Thickness Location.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FlangeThicknessLocation { get; set; }
Public Property FlangeThicknessLocation As Double
	Get
	Set
public:
property double FlangeThicknessLocation {
	double get ();
	void set (double value);
}
member FlangeThicknessLocation : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionHotRolled Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace